app/controllers/dater_profiles_controller.rb

INSERT INTO `dater_profiles` (`twitter`, `updated_at`, `weight`, `myspace_url`, `eye_color`, `about_me`, `facebook_url`, `hair_color`, `height`, `birth_date`, `listed`, `first_name`, `last_name`, `age`, `profile_of_the_day`, `created_at`) VALUES('someone', '2010-03-07 22:41:02', '190', 'www.somewhere.com', 'blue', 'I am someone', 'www.somewhere.com', 'blonde', '5\'10', '2005-02-12', 0, 'John', 'Johnson', 12, 0, '2010-03-07 22:41:02')
---
  def create
    @dp = DaterProfile.new(params[:dater_profile])
    if @dp.save