app/controllers/messages_controller.rb

  def create
    @message = Message.new(params[:message])
    @message.sender = current_user
    @message.recipient = User.find_by_username(params[:message][:to])

    if @message.save
---
SELECT * FROM `users` WHERE (`users`.`username` = 'david') LIMIT 1
INSERT INTO `messages` (`recipient_deleted`, `updated_at`, `body`, `recipient_id`, `subject`, `read_at`, `sender_deleted`, `sender_id`, `created_at`) VALUES(0, '2010-03-16 01:59:29', 'hello', 1, 'hello', NULL, 0, 1, '2010-03-16 01:59:29')
UPDATE `users` SET `updated_at` = '2010-03-16 01:59:29', `last_request_at` = '2010-03-16 01:59:29' WHERE `id` = 1

  def delete_selected
    if request.post?
      if params[:delete]
        params[:delete].each { |id|
          @message = Message.find(:first, :conditions => ["messages.id = ? AND (sender_id = ? OR recipient_id = ?)", id, @user, @user])
---
SELECT * FROM `messages` WHERE (messages.id = '2' AND (sender_id = 1 OR recipient_id = 1)) LIMIT 1