app/controllers/paragraphs_controller.rb

INSERT INTO `paragraphs` (`updated_at`, `story_id`, `p_text`, `created_at`) VALUES('2010-04-18 19:19:24', NULL, NULL, '2010-04-18 19:19:24')
---
 def create
     @pg = Paragraph.create!(params[:paragraph])