app/controllers/stories_controller.rb

  def create
    @story = Story.new(params[:story])
    if @story.save
---
INSERT INTO `stories` (`updated_at`, `title`, `bg_color`, `created_at`) VALUES('2010-04-18 17:55:21', 'something', 'red', '2010-04-18 17:55:21')

  def show
    logger.debug(params[:id])
    @story = Story.find(params[:id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 1)

  def deliver
    @story = Story.find(params[:user_mailer][:story_id])
---
SELECT * FROM `stories` WHERE (`stories`.`id` = 2)