app/controllers/users_controller.rb

INSERT INTO `users` (`last_login_at`, `updated_at`, `last_request_at`, `crypted_password`, `current_login_ip`, `username`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `created_at`, `email`, `last_login_ip`) VALUES(NULL, '2010-03-07 23:18:01', '2010-03-07 23:18:01', '015731f5c1d6b9707dee98c57b3e5d2fc7dfddb55f720b8ce46b173d1f6e108f8760f7783a7fb30f4ac9f0834b06da8517bf78d7fce8194dceddf8eb75d182dd', '127.0.0.1', 'daftdg', 'ah8FFr5ZYrV-yODQWHE6', '2010-03-07 23:18:01', '869b71b09f2493d107297a63260a3056a6ef0ec12245cd183b586a7b9f11e324e65dfc43d18cac57534c39aae7760fcbd667772e48fe47217e31acfdb517bab1', 1, '2010-03-07 23:18:01', 'd@ddlkc.com', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save